#  Target Guided Ordinal Encoding

In [1]:
# Here we import pandas for making dataset

import pandas as pd

In [6]:
# We create a dataset with a categorical and target variable
# In this dataset we have two features city and price 

df=pd.DataFrame({
    "city":["New York","London","Paris","Tokyo","New York","Paris"],
    "price":[200,150,300,250,150,320]
})

In [7]:
# This is our dataset

df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    150
5     Paris    320

In [12]:
# Calculate the mean price of each city
# groupby ( ) function is used for creating a city and price in group

mean_price=df.groupby("city")["price"].mean().to_dict()
mean_price

{'London': 150.0, 'New York': 175.0, 'Paris': 310.0, 'Tokyo': 250.0}

Note 1 - We will take the MEAN becouse there is no outliers 

Note 2 - We will Take the MEDIAN  if there is outliers

In [13]:
# Replace each city with its mean 
# This is final step in which we have to seen that how our city converted into the numerical values 

df["city_encoded"]=df["city"].map(mean_price)

In [14]:
df

       city  price  city_encoded
0  New York    200         175.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    150         175.0
5     Paris    320         310.0

THANK YOU SO MUCH !!

YOURS VIRAT TIWARI :)